#include <iostream>
using namespace std;

int main()
{
	int number;
	cin >> number;

	//Последната цифра е остатъкът при деление на 10
	int lastDigit = number % 10;

	//Първата цифра е числото разделено на 100
	int firstDigit = number / 100;

	/*Средната цифра можем да получим по 2 начина:
	  1. Ако вземем остатъкът при деление на 100, това ще ни даде числото,
	  съставено от последните 2 цифри. Така полученото число делим на 10, за да вземем
	  първата му цифра.
	*/
	int middleDigit = (number % 100) / 10;

	/*2. Ако вземем числото разделено на 10, това ще ни даде числото,
		 съставено от първите 2 цифри. От него взимаме остатъкът при деление на 10.
	int middleDigit = (number / 10) % 10;		 
	*/

	/*Обърнете внимание, че тези пресмятанията за първата и втората цифра, ще работят само
	  ако числото е трицифрено.
	*/

	cout << firstDigit + middleDigit + lastDigit << endl;

	return 0;
}
