#include <iostream>
using namespace std;

int main()
{
	int year;
	cin >> year;

	//Ако годината се дели на 4, то тя е кандидат за високосна
	bool isCandidateLeap = (year % 4 == 0);

	//Ако годината се дели на 4 и на 100, но НЕ и на 400, то тя е изключение и не е високосна
	bool isException = ((year % 4 == 0) && (year % 100 == 0) && (year % 400 != 0));

	//В крайна сметка, годината е кандидат за високосна и НЕ е изключение. 
	bool isLeap = isCandidateLeap && !isException;

	cout << isLeap << endl;

	//Ако съберем условията в едно, получаваме следното:
	(year % 4 == 0) && !((year % 4 == 0) && (year % 100 == 0) && (year % 400 != 0));

	//Заб.* Чрез логически преобразувания, този израз може да бъде преработен до нещо по-просто.


	return 0;
}
